/**
 * 脸部 68 个特征点
 */
export const FaceMap = {
  brow: {
    left: [17, 18, 19, 20, 21],
    right: [22, 23, 24, 25, 26],
  },
  eyes: {
    left: [36, 37, 38, 39, 40, 41],
    right: [42, 43, 44, 45, 46, 47],
  },
  center: [30],
  nose: {
    bridge: [27, 28, 29, 30],
    // 鼻孔
    nostrils: [31, 32, 33, 34, 35],
  },
  mouth: {
    /**
     * 上嘴唇
     */
    upperLip: {
      left: 48,
      right: 54,
      top: [49, 50, 51, 52, 53],
      bottom: [61, 62, 63],
    },
    /**
     * 下嘴唇
     */
    lowerLip: {
      left: 60,
      right: 64,
      top: [65, 66, 67],
      bottom: [55, 56, 57, 58, 59, 60],
    },
  },
  // 下巴
  jaw: [6, 7, 8, 9, 10],
  // 边
  border: [0, 1, 2, 3, 4, 5, 11, 12, 13, 14, 15, 16],
};
